; domain
(define (domain robot-domain)
    (:requirements :typing :adl)
    
    (:types ball arm room robot)
    
    (:predicates 
        (has ?a - arm ?b - ball)
        (at ?x ?y)
        (free ?x - arm)
    )
    
    (:action take
        :parameters (?who - robot ?where - room ?what - ball ?a - arm)
        :precondition (
            and (free ?a) (at ?what ?where) (at ?who ?where) 
        )
        :effect (
            and
                (not (free ?a))
                (has ?a ?what)
                (not (at ?what ?where))
        )
    )

    (:action put-down
        :parameters (?who - robot ?where - room ?what - ball ?a - arm)
        :precondition (
            and
                (not (free ?a))
                (has ?a ?what)
                (at ?who ?where)
        )
        :effect (
            and
                (free ?a)
                (at ?what ?where)
                (not (has ?a ?what))
        )
    )

    (:action move
        :parameters (?who - robot ?from ?to - room)
        :precondition (
            and
                (at ?who ?from)
        )
        :effect (
            and
                (not (at ?who ?from))
                (at ?who ?to)
        )
    )
)

; problem
(define (problem robot-problem)
    (:domain robot-domain)
    (:objects
        agent - robot
        room1 room2 - room
        arm1 arm2 - arm
        b1 b2 b3 - ball
    )
    (:init
        (at agent room1)
        (at b1 room1)
        (at b2 room1)
        (at b3 room1)
        (free arm1)
        (free arm2)
    )
    (:goal
        (and
            (at agent room2)
            (at b1 room2)
            (at b2 room2)
            (at b3 room2)
        )
    )
)

; plan
1. (take agent room1 b1 arm2)
   deleted: (free arm2) (at b1 room1)
   added: (has arm2 b1)
   goals met: 0 of 4
2. (take agent room1 b2 arm1)
   deleted: (free arm1) (at b2 room1)
   added: (has arm1 b2)
   goals met: 0 of 4
3. (move agent room1 room2)
   deleted: (at agent room1)
   added: (at agent room2)
   goals met: 1 of 4
4. (put-down agent room2 b2 arm1)
   deleted: (has arm1 b2)
   added: (free arm1) (at b2 room2)
   goals met: 2 of 4
5. (put-down agent room2 b1 arm2)
   deleted: (has arm2 b1)
   added: (free arm2) (at b1 room2)
   goals met: 3 of 4
6. (move agent room2 room1)
   deleted: (at agent room2)
   added: (at agent room1)
   goals met: 2 of 4
7. (take agent room1 b3 arm2)
   deleted: (free arm2) (at b3 room1)
   added: (has arm2 b3)
   goals met: 2 of 4
8. (move agent room1 room2)
   deleted: (at agent room1)
   added: (at agent room2)
   goals met: 3 of 4
9. (put-down agent room2 b3 arm2)
   deleted: (has arm2 b3)
   added: (free arm2) (at b3 room2)
   goals met: 4 of 4
